{
    "services": [
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "Application Development",
            "service_desc": "We specialize in creating and optimizing high-quality, custom websites and applications tailored to the unique needs of businesses and organizations. Our focus is on delivering mobile-friendly, intuitive, and robust solutions."
        },
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "Cloud Services",
            "service_desc": "Our cloud services offer scalable and secure solutions to enhance your IT infrastructure. From cloud migration and deployment to management and optimization, we help you leverage cloud technology for improved efficiency and flexibility."
        },
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "Maintenance & Support",
            "service_desc": "We provide comprehensive maintenance and support services to ensure your systems and applications run smoothly. Our proactive approach includes regular updates, troubleshooting, and quick resolution of any issues that arise."
        },
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "Data Analytics & BI",
            "service_desc": "Our data analytics and business intelligence services transform raw data into actionable insights. We help you leverage data to make informed decisions, optimize processes, and drive strategic growth."
        },
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "DevOps",
            "service_desc": "We integrate development and operations to streamline your software delivery process. Our DevOps services focus on automation, continuous integration, and continuous deployment to enhance collaboration and speed up delivery."
        },
        {
            "icon": "/static/assets/Icons/icon1.svg",
            "service_name": "Quality Engineering",
            "service_desc": "Our quality engineering services ensure your software meets the highest standards of performance, reliability, and security. We implement rigorous testing processes to detect and resolve issues before they impact your users."
        }
    ]
}
